controllers/CommunityController.php

	public function actionAddcomm()
    {
        // add Community controller
        if (!$post = \Yii::$app->getRequest()->getBodyParams()) {
            throw new \yii\web\HttpException(400, 'Дані не отримані');
        }
        $communityModel = new Community();
        if ($communityModel->findByCommunityName($post['community_name'])){
            throw new \yii\web\HttpException(400, 'Користувач з таким логіном уже існує');
        }
        $transaction = \Yii::$app->db->beginTransaction();
        try {
            $communityModel = new Community();
            $communityModel->name = $post['community_name'];
            $communityModel->prefix = $post['community_num'];
            $communityModel->commissioner_id = (int)$post['commissioner_id'];
            $communityModel->notes = $post['community_additions'];
            if (!$communityModel->save()){
                foreach($communityModel->errors as $key){
                    $errorMessage .= $key[0];
                }
                throw new \yii\web\HttpException(422,$errorMessage);
            }
            $transaction->commit();
            $userModel = User::findUserById($post['commissioner_id']);
            $userModel->role_id = 4;
            $userModel->community_id = $communityModel->community_id;
            $userModel->save();
---
INSERT INTO `community` (`name`, `prefix`, `commissioner_id`, `notes`) VALUES ('new gromada12', '8324768273632', 16, 'test')
UPDATE `user` SET `role_id`=4, `community_id`=27 WHERE `user_id`=16