controllers/UserController.php

    public function actionLogin()
    {
        $modelLoginFrom = new LoginForm();

        if ($modelLoginFrom->load(\Yii::$app->getRequest()->getBodyParams(), '') && $modelLoginFrom->login()) {
            $post = \Yii::$app->getRequest()->getBodyParams();

            $modelUser = new User();

            $modelRole = new Role();
            $result = $modelRole->find()
                ->where(['=','role_id', \Yii::$app->user->identity->getRole()]
                )->all();
            $resultuserdata = $modelUser->find()
                ->where(['=','username', $post['username']]
                )->one();
---
SELECT * FROM `user` WHERE `username` = 'registrar'
SELECT * FROM `role` WHERE `role_id` = 2