models/Community.php

    public static function findByCommunityName($community_name)
    {
        //find Community in DB by Name
        return static::findOne(['name' => $community_name]);
---
SELECT * FROM `community` WHERE `name`='new gromada12'