models/Resource.php

SELECT * FROM `parameter` WHERE `resource_id`=185
---
    public function fields()
    {
    	return [
    			'resource_id',
    			'name',
    			'class' => function ($model) {
    				return $model->class->name;
    			},
				'parameters' => function($model){
					$parametersData = $model->parameters;
					foreach($parametersData as $parameter){
						$parameters[$parameter->getAttributeName($parameter->attribute_id)] = $parameter->value;
					}
					return $parameters;
				},
    			'coordinates',
                'reason',
    			'owner' => function ($model) {
    				return $model->ownerData;
    			},
                'date',
                'registrar_data_id',
                'registration_number'
    	];