models/User.php

SELECT * FROM `user` WHERE `user_id`=16
---
    public static function findUserById($user_id)
    {
        // find user by id
        return static::findOne(['user_id' => $user_id]);

SELECT * FROM `user` WHERE `username`='demo'
---
    public static function getUserByUserName($username)
    {
        // Get user by username
       return static::findOne(['username' => $username]);